app/Controllers/Admin/ShariController.php

    public function addJamdani(){

        if($this->request->getPost()){
            $product = $this->request->getVar();
            // dd($product);
            $insertProduct = new JamdaniModel();

             $img = $this->request->getFile('image');

          if (! $img->hasMoved()) {
                    $imagename = $img->store();

                    $filepath = WRITEPATH . 'uploads/' . $imagename;
                    $data = ['uploaded_fileinfo' => new File($filepath)];
             }



            $form_data = [
                'category' => $product['category'],
                'title' => $product['title'],
                'price' => $product['price'],
                'd_price' => $product['d_price'],
                'description' => $product['description'],
                'image' => $imagename,
                'sku' => $product['sku'],
                'quantity' => $product['quantity'],
            ];


            if( $insertProduct->insert($form_data)){
---
INSERT INTO `jamdani` (`category`, `title`, `price`, `d_price`, `description`, `image`, `sku`, `quantity`) VALUES ('shari', 'Woven, Paisley, Self Design, Polka Print, Floral Print,...', '12000', '1000', 'Style Code\r\n1955S350Q\r\nPattern\r\nPrinted\r\nPack of\r\n1\r\nOccasion\r\nParty & Festive\r\nDecorative Material\r\nFloral Design\r\nConstruction Type\r\nBlue Color Saree Have Floral Print, Printed Work With Printed Border.\r\nFabric Care\r\nDry Clean Only\r\nFabric\r\nGeorgette\r\nType\r\nBaluchari\r\nBlouse Piece\r\nUnstitched\r\nSari Style\r\nRegular Sari\r\nNet Quantity\r\n1\r\nSari Length\r\n5.5m\r\nBlouse Piece Length\r\n0.7 m\r\nWeight\r\n0.36 kg', '20230704/1688441837_fb3c9a075207fc60a0d0.jpeg', '108', '23')