app/Controllers/JamdaniController.php

    public function all(){
        $select = new JamdaniModel();

        $data = [
            'pdata' => $select->findAll(),
            'pdata' => $select->paginate(5),
            'pager' => $select->pager,

        ];
---
SELECT *
FROM `jamdani`
SELECT *
FROM `jamdani`
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `jamdani`